python, numpy, pandas 날짜 타입 비교 및 정리
- https://ellun.tistory.com/320

In [4]:
# timestamp -> str
import time
print(time.time())
type(time.time())
timestamp = time.time()
s = str(timestamp)
print(s,type(s))

1626746920.7209883
1626746920.7209883 <class 'str'>

In [34]:
# datetime - > str
from datetime import datetime
s = datetime.now()
print(s,type(s))

s1 = datetime.now().strftime('%Y-%m-%d %H:%M:%S')
print(s1,type(s1))

2021-07-20 12:20:29.729013 <class 'datetime.datetime'>
2021-07-20 12:20:29 <class 'str'>

In [11]:
# str -> datetime
from datetime import datetime
s = '2021-07-20 11:13:58'
d = datetime.strptime(s,'%Y-%m-%d %H:%M:%S')
print(d,type(d))

2021-07-20 11:13:58 <class 'datetime.datetime'>

In [12]:
# str -> timestamp
s = '2021-07-20 11:13:58'
timestamp = time.mktime(datetime.strptime(s,'%Y-%m-%d %H:%M:%S').timetuple())
print(timestamp,type(timestamp))

1626747238.0 <class 'float'>

In [14]:
# datetime -> timestamp
timestamp = time.mktime(datetime.today().timetuple())
print(timestamp, type(timestamp))

1626747931.0 <class 'float'>

In [36]:
# timestamp -> datetime
t = time.time()
print(t)
d = datetime.fromtimestamp(t)
print(d,type(d))

1626751238.7134328
2021-07-20 12:20:38.713433 <class 'datetime.datetime'>

In [37]:
# 판다스 to_datetime
pd.to_datetime(1626751238.7134328,unit='s')

Timestamp('2021-07-20 03:20:38.713432832')

In [19]:
# 1년전 datetime 값
from datetime import timedelta
import time

datetime_now = datetime.now()
delta_datetime = timedelta(days=-365)
print(delta_datetime)
datetime_now + delta_datetime

-365 days, 0:00:00

datetime.datetime(2020, 7, 20, 11, 31, 52, 384009)

In [20]:
# 두 날짜간의 일수 구하기
since_timestamp = datetime.strptime('20180301','%Y%m%d')
until_timestamp = datetime.strptime('20180331','%Y%m%d')
result = until_timestamp - since_timestamp
result

datetime.timedelta(days=30)

In [21]:
# 특정일 구하기
import datetime
def get_yoil(y,m,d):
    days = ['MON','TUE','WED','THU','FRI','SAT','SUN']
    return days[datetime.date(y,m,d).weekday()]
get_yoil(2021,7,20)

'TUE'

In [22]:
import pandas as pd
date = pd.Timestamp(1626747931.0,unit='s',tz='Asia/Seoul')
print(date,type(date))

2021-07-20 11:25:31+09:00 <class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [83]:
df = pd.read_csv('dataset/stock-data.csv')
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [84]:
df['New_Date'] = pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   New_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

In [85]:
df.drop('Date',axis=1,inplace=True)
df['year'] = df['New_Date'].dt.year
df['month'] = df['New_Date'].dt.month
df['day'] = df['New_Date'].dt.day
df.head()

   Close  Start   High    Low  Volume   New_Date  year  month  day
0  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  10800  10900  11000  10700   63039 2018-06-26  2018      6   26

In [86]:
df.set_index('New_Date',inplace=True)
df.head()

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-07-02  10100  10850  10900  10000  137977  2018      7    2
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [28]:
df.index

DatetimeIndex(['2018-07-02', '2018-06-29', '2018-06-28', '2018-06-27',
               '2018-06-26', '2018-06-25', '2018-06-22', '2018-06-21',
               '2018-06-20', '2018-06-19', '2018-06-18', '2018-06-15',
               '2018-06-14', '2018-06-12', '2018-06-11', '2018-06-08',
               '2018-06-07', '2018-06-05', '2018-06-04', '2018-06-01'],
              dtype='datetime64[ns]', name='New_Date', freq=None)

In [91]:
df_ymd_range = df['2018-06-29':'2018-06-26']
df_ymd_range

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [92]:
df_ymd_range = df['2018-06-26':'2018-06-29']
df_ymd_range

Empty DataFrame
Columns: [Close, Start, High, Low, Volume, year, month, day]
Index: []

In [31]:
df_ym = df.loc['2018-07','Start':'High']
df_ym

            Start   High
New_Date
2018-07-02  10850  10900

In [39]:
import numpy as np
import pandas as pd
# Time Series Basics
from datetime import datetime
dates = [datetime(2011,1,2),datetime(2011,1,5),
        datetime(2011,1,7),datetime(2011,1,8),
        datetime(2011,1,10),datetime(2011,1,12)]
ts = pd.Series(np.random.randn(6),index=dates)
ts

2011-01-02   -1.002346
2011-01-05   -1.015073
2011-01-07   -0.546466
2011-01-08    0.230811
2011-01-10    1.089753
2011-01-12   -0.642663
dtype: float64

In [40]:
ts.index

DatetimeIndex(['2011-01-02', '2011-01-05', '2011-01-07', '2011-01-08',
               '2011-01-10', '2011-01-12'],
              dtype='datetime64[ns]', freq=None)

In [41]:
ts[::2]

2011-01-02   -1.002346
2011-01-07   -0.546466
2011-01-10    1.089753
dtype: float64

In [42]:
ts + ts[::2]

2011-01-02   -2.004692
2011-01-05         NaN
2011-01-07   -1.092931
2011-01-08         NaN
2011-01-10    2.179506
2011-01-12         NaN
dtype: float64

In [43]:
ts.index[0]

Timestamp('2011-01-02 00:00:00')

In [44]:
# Indexing, Selection, Subsetting
stamp = ts.index[2]
ts[stamp]

-0.546465516485552

In [45]:
# 2011-01-10    1.089753
print(ts['1/10/2011'])
ts['20110110']

1.0897528460611405

1.0897528460611405

In [46]:
longer_ts = pd.Series(np.random.randn(1000),
                     index=pd.date_range('1/1/2000',periods=1000))
print(longer_ts,'\n')

2000-01-01    0.641458
2000-01-02   -0.059527
2000-01-03   -0.337938
2000-01-04   -0.645372
2000-01-05    0.994758
                ...
2002-09-22   -0.510389
2002-09-23    0.698721
2002-09-24    1.116817
2002-09-25    0.225435
2002-09-26    0.021046
Freq: D, Length: 1000, dtype: float64

In [49]:
longer_ts['2001-05'][:5]

2001-05-01   -0.634009
2001-05-02   -1.047831
2001-05-03    1.994927
2001-05-04    0.473721
2001-05-05   -0.125936
Freq: D, dtype: float64

In [51]:
ts[datetime(2011,1,7):]

2011-01-07   -0.546466
2011-01-08    0.230811
2011-01-10    1.089753
2011-01-12   -0.642663
dtype: float64

In [53]:
ts

2011-01-02   -1.002346
2011-01-05   -1.015073
2011-01-07   -0.546466
2011-01-08    0.230811
2011-01-10    1.089753
2011-01-12   -0.642663
dtype: float64

In [54]:
# truncate
print(ts.truncate(before='2011-01-05',after='2011-01-10'))

2011-01-05   -1.015073
2011-01-07   -0.546466
2011-01-08    0.230811
2011-01-10    1.089753
dtype: float64

In [55]:
print(ts.truncate(after='1/9/2011'))

2011-01-02   -1.002346
2011-01-05   -1.015073
2011-01-07   -0.546466
2011-01-08    0.230811
dtype: float64

In [56]:
pd.date_range('2020-10-7','2020-10-20')

DatetimeIndex(['2020-10-07', '2020-10-08', '2020-10-09', '2020-10-10',
               '2020-10-11', '2020-10-12', '2020-10-13', '2020-10-14',
               '2020-10-15', '2020-10-16', '2020-10-17', '2020-10-18',
               '2020-10-19', '2020-10-20'],
              dtype='datetime64[ns]', freq='D')

In [57]:
from datetime import datetime
from datetime import timedelta

now = datetime.now()
in_two_weeks=now+timedelta(weeks=2)
pd.date_range(datetime.now(),in_two_weeks)

DatetimeIndex(['2021-07-20 14:11:52.963651', '2021-07-21 14:11:52.963651',
               '2021-07-22 14:11:52.963651', '2021-07-23 14:11:52.963651',
               '2021-07-24 14:11:52.963651', '2021-07-25 14:11:52.963651',
               '2021-07-26 14:11:52.963651', '2021-07-27 14:11:52.963651',
               '2021-07-28 14:11:52.963651', '2021-07-29 14:11:52.963651',
               '2021-07-30 14:11:52.963651', '2021-07-31 14:11:52.963651',
               '2021-08-01 14:11:52.963651', '2021-08-02 14:11:52.963651',
               '2021-08-03 14:11:52.963651'],
              dtype='datetime64[ns]', freq='D')

In [62]:
# periods 매개변수는 date_range 함수에 전달된 시작날짜와 종료날짜를
# periods 매개변수에 전달된 기준의 수만큼 동일하게 나누어 출력
pd.date_range(start='2020-10-01',end='2020-10-20',periods=5)

DatetimeIndex(['2020-10-01 00:00:00', '2020-10-05 18:00:00',
               '2020-10-10 12:00:00', '2020-10-15 06:00:00',
               '2020-10-20 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [64]:
pd.date_range('2012-05-02 12:56:31', periods=5, normalize=True)

DatetimeIndex(['2012-05-02', '2012-05-03', '2012-05-04', '2012-05-05',
               '2012-05-06'],
              dtype='datetime64[ns]', freq='D')

freq 매개변수에 사용되는 Frequncy strings
- A calendar year end frequency
- B	business day frequency
- C	custom business day frequency
- D	calendar day frequency
- W	weekly frequency
- M	month end frequency
- SM	semi-month end frequency (15th and end of month)
- BM	business month end frequency
- CBM	custom business month end frequency
- MS	month start frequency
- SMS	semi-month start frequency (1st and 15th)
- BMS	business month start frequency
- CBMS	custom business month start frequency
- Q	quarter end frequency

In [65]:
import numpy as np
dates = pd.date_range('1/1/2000', periods=100, freq='W-WED')
print(dates)

DatetimeIndex(['2000-01-05', '2000-01-12', '2000-01-19', '2000-01-26',
               '2000-02-02', '2000-02-09', '2000-02-16', '2000-02-23',
               '2000-03-01', '2000-03-08', '2000-03-15', '2000-03-22',
               '2000-03-29', '2000-04-05', '2000-04-12', '2000-04-19',
               '2000-04-26', '2000-05-03', '2000-05-10', '2000-05-17',
               '2000-05-24', '2000-05-31', '2000-06-07', '2000-06-14',
               '2000-06-21', '2000-06-28', '2000-07-05', '2000-07-12',
               '2000-07-19', '2000-07-26', '2000-08-02', '2000-08-09',
               '2000-08-16', '2000-08-23', '2000-08-30', '2000-09-06',
               '2000-09-13', '2000-09-20', '2000-09-27', '2000-10-04',
               '2000-10-11', '2000-10-18', '2000-10-25', '2000-11-01',
               '2000-11-08', '2000-11-15', '2000-11-22', '2000-11-29',
               '2000-12-06', '2000-12-13', '2000-12-20', '2000-12-27',
               '2001-01-03', '2001-01-10', '2001-01-17', '2001-01-24',
               '2001-01-31', '2001-02-07', '2001-02-14', '2001-02-21',
               '2001-02-28', '2001-03-07', '2001-03-14', '2001-03-21',
               '2001-03-28', '2001-04-04', '2001-04-11', '2001-04-18',
               '2001-04-25', '2001-05-02', '2001-05-09', '2001-05-16',
               '2001-05-23', '2001-05-30', '2001-06-06', '2001-06-13',
               '2001-06-20', '2001-06-27', '2001-07-04', '2001-07-11',
               '2001-07-18', '2001-07-25', '2001-08-01', '2001-08-08',
               '2001-08-15', '2001-08-22', '2001-08-29', '2001-09-05',
               '2001-09-12', '2001-09-19', '2001-09-26', '2001-10-03',
               '2001-10-10', '2001-10-17', '2001-10-24', '2001-10-31',
               '2001-11-07', '2001-11-14', '2001-11-21', '2001-11-28'],
              dtype='datetime64[ns]', freq='W-WED')

In [67]:
long_df = pd.DataFrame(np.random.randn(100,4),
                      index=dates,
                      columns = ['Colorado','Texas','New York','Ohio'])
print(long_df,'\n')
long_df.loc['2001-06']

            Colorado     Texas  New York      Ohio
2000-01-05 -0.441085  1.287963 -0.060799  0.109101
2000-01-12 -0.298944 -0.874732 -0.625747 -0.549979
2000-01-19  0.675000  1.330668 -0.681337  1.098610
2000-01-26  0.452010  0.024461 -1.038523  0.571128
2000-02-02  1.286345 -0.768212 -0.953816 -0.353519
...              ...       ...       ...       ...
2001-10-31 -0.006981  1.291081 -0.696848 -0.400194
2001-11-07  1.316462 -0.515380  0.480864  1.325687
2001-11-14 -0.214950  0.188236  0.788619  0.368392
2001-11-21  1.345041  0.039718  0.682622  0.906851
2001-11-28 -0.898369 -0.227789 -0.923387 -1.028037

[100 rows x 4 columns]

            Colorado     Texas  New York      Ohio
2001-06-06  0.473579 -0.443727  0.040771 -0.355599
2001-06-13 -0.038756 -1.221942 -1.098992 -0.815568
2001-06-20  0.637949 -1.487480 -0.288095 -1.192054
2001-06-27  0.828341 -0.117620  2.210951  0.524021

In [68]:
dates = pd.DatetimeIndex(['1/1/2000','1/2/2000','1/2/2000','1/2/2000',
                         '1/3/2000'])
dup_ts = pd.Series(np.arange(5),index=dates)
dup_ts

2000-01-01    0
2000-01-02    1
2000-01-02    2
2000-01-02    3
2000-01-03    4
dtype: int32

In [69]:
dup_ts.index.is_unique

False

In [70]:
dup_ts['1/3/2000'] # not duplicated의 경우 스칼라 값

4

In [71]:
dup_ts['1/2/2000'] # duplicated의 경우 슬라이스 출력

2000-01-02    1
2000-01-02    2
2000-01-02    3
dtype: int32

In [72]:
grouped = dup_ts.groupby(level=0)
print(grouped.mean())
grouped.count()

2000-01-01    0
2000-01-02    2
2000-01-03    4
dtype: int32

2000-01-01    1
2000-01-02    3
2000-01-03    1
dtype: int64

In [73]:
pd.date_range('2000-01-01','2000-01-03 23:59',freq='4h')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 04:00:00',
               '2000-01-01 08:00:00', '2000-01-01 12:00:00',
               '2000-01-01 16:00:00', '2000-01-01 20:00:00',
               '2000-01-02 00:00:00', '2000-01-02 04:00:00',
               '2000-01-02 08:00:00', '2000-01-02 12:00:00',
               '2000-01-02 16:00:00', '2000-01-02 20:00:00',
               '2000-01-03 00:00:00', '2000-01-03 04:00:00',
               '2000-01-03 08:00:00', '2000-01-03 12:00:00',
               '2000-01-03 16:00:00', '2000-01-03 20:00:00'],
              dtype='datetime64[ns]', freq='4H')

In [74]:
from pandas.tseries.offsets import Hour, Minute
Hour(2) + Minute(30)

In [76]:
pd.date_range('2000-01-01', periods=10, freq='1h30min')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 01:30:00',
               '2000-01-01 03:00:00', '2000-01-01 04:30:00',
               '2000-01-01 06:00:00', '2000-01-01 07:30:00',
               '2000-01-01 09:00:00', '2000-01-01 10:30:00',
               '2000-01-01 12:00:00', '2000-01-01 13:30:00'],
              dtype='datetime64[ns]', freq='90T')

In [80]:
rng = pd.date_range('2000-01-01','2012-09-01',freq='WOM-3FRI')
print(rng)

DatetimeIndex(['2000-01-21', '2000-02-18', '2000-03-17', '2000-04-21',
               '2000-05-19', '2000-06-16', '2000-07-21', '2000-08-18',
               '2000-09-15', '2000-10-20',
               ...
               '2011-11-18', '2011-12-16', '2012-01-20', '2012-02-17',
               '2012-03-16', '2012-04-20', '2012-05-18', '2012-06-15',
               '2012-07-20', '2012-08-17'],
              dtype='datetime64[ns]', length=152, freq='WOM-3FRI')

In [81]:
from pandas.tseries.offsets import Day, MonthEnd
now = datetime(2011, 11, 17)
now + 3 * Day()

Timestamp('2011-11-20 00:00:00')

In [82]:
offset = MonthEnd()
print(offset.rollforward(now))
offset.rollback(now)

2011-11-30 00:00:00

Timestamp('2011-10-31 00:00:00')

In [ ]:
ts = pd.Series(np.random.randn(20),
               index=pd.date_range('1/15/2000', periods=20, freq='4d'))
print(ts)

In [ ]:
# 과제
# Q. offset.rollforward 기준으로 그룹화를 진행 후 그룹별 평균값을 출력하세요.

In [ ]:
# 과제
# Q. 상기 문제를 resample을 사용하여 수행하세요.

In [ ]:
# 과제
# Q. 날짜 데이터를 인덱스로 하는 5가지 이상의 컬럼을 포함하고 있는 데이터 셋을 
# 생성하세요.단 각 컬럼은 인덱스별 의미있는 값을 갖도록 만든 후 다음을 수행하세요
# - 특정 연별, 월별, 일별 특정 컬럼 값 집계
# - 인덱스를 실수형으로 변환 후 다시 datetiem으로 변환
# - 인덱스의 포멧을 변환

In [1]:
# Periods and Period Arithmetic
import pandas as pd
p = pd.Period(2007,freq='A-DEC')
p

Period('2007', 'A-DEC')

In [2]:
print(p+5)

2012

In [3]:
p-2

Period('2005', 'A-DEC')

In [11]:
# 기간을 타임스탬프로 변환
import numpy as np
rng = pd.period_range('2000-01-01',periods=3, freq='M')
ts = pd.Series(np.random.randn(3),index=rng)
print(ts,'\n')
ts.to_timestamp(how='end')

2000-01   -0.009327
2000-02    1.503705
2000-03   -0.646172
Freq: M, dtype: float64

2000-01-31 23:59:59.999999999   -0.009327
2000-02-29 23:59:59.999999999    1.503705
2000-03-31 23:59:59.999999999   -0.646172
dtype: float64

In [12]:
# Downsampling
rng = pd.date_range('2001-01-01',periods=12,freq='T')
ts = pd.Series(np.arange(12),index=rng)
ts

2001-01-01 00:00:00     0
2001-01-01 00:01:00     1
2001-01-01 00:02:00     2
2001-01-01 00:03:00     3
2001-01-01 00:04:00     4
2001-01-01 00:05:00     5
2001-01-01 00:06:00     6
2001-01-01 00:07:00     7
2001-01-01 00:08:00     8
2001-01-01 00:09:00     9
2001-01-01 00:10:00    10
2001-01-01 00:11:00    11
Freq: T, dtype: int32

In [13]:
ts.resample('5min', closed='right').sum()

2000-12-31 23:55:00     0
2001-01-01 00:00:00    15
2001-01-01 00:05:00    40
2001-01-01 00:10:00    11
Freq: 5T, dtype: int32

In [14]:
ts.resample('5min').ohlc()

                     open  high  low  close
2001-01-01 00:00:00     0     4    0      4
2001-01-01 00:05:00     5     9    5      9
2001-01-01 00:10:00    10    11   10     11

In [15]:
frame = pd.DataFrame(np.random.randn(2,4),
                    index=pd.date_range('1/1/2000',periods=2,
                                       freq='W-WED'),
                    columns=['Colorado','Texas','New York','Ohio'])
frame

            Colorado     Texas  New York      Ohio
2000-01-05 -1.047179  2.017577 -0.334957 -0.149904
2000-01-12  0.337033 -1.041140 -1.719794 -1.763963

In [16]:
df_daily = frame.resample('D').asfreq()
df_daily

            Colorado     Texas  New York      Ohio
2000-01-05 -1.047179  2.017577 -0.334957 -0.149904
2000-01-06       NaN       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN       NaN
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.337033 -1.041140 -1.719794 -1.763963

In [17]:
frame.resample('D').ffill()

            Colorado     Texas  New York      Ohio
2000-01-05 -1.047179  2.017577 -0.334957 -0.149904
2000-01-06 -1.047179  2.017577 -0.334957 -0.149904
2000-01-07 -1.047179  2.017577 -0.334957 -0.149904
2000-01-08 -1.047179  2.017577 -0.334957 -0.149904
2000-01-09 -1.047179  2.017577 -0.334957 -0.149904
2000-01-10 -1.047179  2.017577 -0.334957 -0.149904
2000-01-11 -1.047179  2.017577 -0.334957 -0.149904
2000-01-12  0.337033 -1.041140 -1.719794 -1.763963

In [18]:
frame.resample('D').ffill(limit=2)

            Colorado     Texas  New York      Ohio
2000-01-05 -1.047179  2.017577 -0.334957 -0.149904
2000-01-06 -1.047179  2.017577 -0.334957 -0.149904
2000-01-07 -1.047179  2.017577 -0.334957 -0.149904
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.337033 -1.041140 -1.719794 -1.763963